In [17]:
import mysql.connector 
#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
  database = "class6:30am"
)
db = database.cursor()

In [3]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 412, 80, 'A')
(2, 'Shyam', 78, 89, 95, 67, 80, 420, 80, 'A')

In [4]:
db.execute("SELECT name,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

('Ram', 'A')
('Shyam', 'A')

In [5]:
sql = "INSERT INTO student (name,physics,chemistry,math,english,nepali,total,per,grade) VALUES('Sumit',56,78,56,89,67,350,65,'B')"
db.execute(sql)
database.commit()

In [7]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics = "))
    chemistry = int(input("Enter chemistry = "))
    math = int(input("Enter math = "))
    english = int(input("Enter english = "))
    nepali = int(input("Enter nepali = "))
    total = sum([physics,chemistry,math,english,nepali])
    per = total/5
    if per > 80:
        grade = "A"
    elif per > 60:
        grade = "B"
    elif per > 45:
        grade = "C"
    else:
        grade = "F"
    
    sql = f"INSERT INTO student (name,physics,chemistry,math,english,nepali,total,per,grade) VALUES('{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')"
    
    db.execute(sql)
    
database.commit()

Enter n = 1
Enter name = Nabin
Enter physics = 89
Enter chemistry = 87
Enter math = 90
Enter english = 67
Enter nepali = 56

In [8]:
print(sql)

INSERT INTO student (name,physics,chemistry,math,english,nepali,total,per,grade) VALUES('Nabin',89,87,90,67,56,389,77.8,'B')

In [10]:
db.execute("SELECT * FROM student WHERE grade = 'A' ")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 412, 80, 'A')
(2, 'Shyam', 78, 89, 95, 67, 80, 420, 80, 'A')

In [15]:
db.execute("SELECT * FROM student WHERE physics > 80  or chemistry > 70")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 412, 80, 'A')
(2, 'Shyam', 78, 89, 95, 67, 80, 420, 80, 'A')
(3, 'Sumit', 56, 78, 56, 89, 67, 350, 65, 'B')
(4, 'Nabin', 89, 87, 90, 67, 56, 389, 78, 'B')

In [18]:
db.execute("SELECT * FROM student WHERE bio LIKE '%python%' ")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 78, 89, 95, 67, 80, 420, 80, 'A', 'I am python developer')

In [ ]:
search = input("Enter data = ")
db.execute(f"SELECT * FROM student WHERE bio LIKE '%{search}%' ")
result =db.fetchall()
for x in result:
    print(x)

In [19]:
sql = "DELETE FROM student WHERE sn = 4"
db.execute(sql)
database.commit()